<?php 
 
// RGB values
// http://www.emanueleferonato.com/2009/08/28/color-differences-algorithm/
function rgb_to_xyz($rgb){
    $red = $rgb[0];
    $green = $rgb[1];
    $blue = $rgb[2];

    // same values, from 0 to 1
    $_red = $red/255;
    $_green = $green/255;
    $_blue = $blue/255;

    // adjusting values
    if($_red>0.04045){
        $_red = ($_red+0.055)/1.055;
        $_red = pow($_red,2.4);
    }
    else{
        $_red = $_red/12.92;
    }
    if($_green>0.04045){
        $_green = ($_green+0.055)/1.055;
        $_green = pow($_green,2.4);     
    }
    else{
        $_green = $_green/12.92;
    }
    if($_blue>0.04045){
        $_blue = ($_blue+0.055)/1.055;
        $_blue = pow($_blue,2.4);     
    }
    else{
        $_blue = $_blue/12.92;
    }

    $_red *= 100;
    $_green *= 100;
    $_blue *= 100;

    // applying the matrix
    $x = $_red * 0.4124 + $_green * 0.3576 + $_blue * 0.1805;
    $y = $_red * 0.2126 + $_green * 0.7152 + $_blue * 0.0722;
    $z = $_red * 0.0193 + $_green * 0.1192 + $_blue * 0.9505;

    return array($x, $y, $z);
}
 
function xyz_to_Lab($xyz) {
    $x = $xyz[0];
    $y = $xyz[1];
    $z = $xyz[2];

    $_x = $x/95.047;
    $_y = $y/100;
    $_z = $z/108.883;

    // adjusting the values
    if($_x>0.008856){
        $_x = pow($_x,1/3);
    }
    else{
        $_x = 7.787*$_x + 16/116;
    }
    if($_y>0.008856){
        $_y = pow($_y,1/3);
    }
    else{
        $_y = (7.787*$_y) + (16/116);
    }
    if($_z>0.008856){
        $_z = pow($_z,1/3);
    }
    else{
        $_z = 7.787*$_z + 16/116;
    }

    $l= 116*$_y -16;
    $a= 500*($_x-$_y);
    $b= 200*($_y-$_z);

    return array($l, $a, $b);
}

function rgb_to_Lab($rgb) {
    return xyz_to_Lab(rgb_to_xyz($rgb));
}

function CIE76($lab1, $lab2) {
    return sqrt(pow($lab1[0] - $lab2[0],2) + pow($lab1[1] - $lab2[1],2) + pow($lab1[2] - $lab2[2],2));
}

function rgb_CIE76($rgb1, $rgb2) {
    return CIE76(xyz_to_Lab(rgb_to_xyz($rgb1)), xyz_to_Lab(rgb_to_xyz($rgb2)));
}

// 式はWikipediaから
// http://en.wikipedia.org/wiki/Color_difference
function CIE94($lab1, $lab2) {
    $deltaL = $lab1[0] - $lab2[0];
    $c1 = sqrt(pow($lab1[1],2) + pow($lab1[2],2));
    $c2 = sqrt(pow($lab2[1],2) + pow($lab2[2],2));
    $deltaCab = $c1 - $c2;
    $deltaHab = sqrt(pow(CIE76($lab1, $lab2),2) - pow($deltaL, 2) - pow($deltaCab,2));
    $deltaHab2 = sqrt(pow($lab1[1] - $lab2[1],2) + pow($lab1[2] - $lab2[2], 2) - pow($deltaCab,2));
    $deltaHab = 0;

    $KL = 1;
    $K1 = 0.045;
    $K2 = 0.015;

    return sqrt(pow($deltaL/$KL,2) + pow($deltaCab / (1 + $K1*$c1),2) + pow($deltaHab/(1 + $K2*$c1),2));
}

function rgb_CIE94($rgb1, $rgb2) {
    return CIE94(xyz_to_Lab(rgb_to_xyz($rgb1)), xyz_to_Lab(rgb_to_xyz($rgb2)));
}
    
// ANSI 256colorのRGBをLabに変換
$LabArray = array();

for ($green = 0; $green < 6; $green++) {
    for ($red = 0; $red < 6; $red++) {
        for ($blue = 0; $blue < 6; $blue++) {
            $color = 16 + ($red * 36) + ($green * 6) + $blue;
            $rgb = array(
                ($red ? ($red * 40 + 55) : 0),
                ($green ? ($green * 40 + 55) : 0),
                ($blue ? ($blue * 40 + 55) : 0)
            );
            //$black = array(0, 0, 0);
            //print round(rgb_CIE76($rgb, $black)) . " \x1b[38;5;${color}m$color\x1b[0m\n";
            $LabArray[$color] = rgb_to_Lab($rgb);
        }
    }
}

// Labに変換した配列をJSON化
print json_encode($LabArray);
//print_r( rgb_to_Lab(array(0,0,0)));
//print_r( rgb_to_Lab(array(256,256,256)));

// -----ここで一旦プログラムの終了。続きは以下のサイト -----
// CIE ⊿E2000 計算機 http://www.mega.t-kougei.ac.jp/color/cie.htm
// Labで表したANSI colorを使ってblackとの色差を計算
// コンソールで以下のJavaScriptを実行する
// var color = <json_encode($LabArray)の文字列>;
// //それぞれの色とblackとの色差を計算
// var cie = [];
// for( var key in color) {
//     cie.push({color : key, coldiff : CIEDE2000(color[key][0],color[key][1],color[key][2],0,0,0,1,1,1)});
// }
// // 色差で昇順にする
// cie.sort(function(a, b){ return a["coldiff"] - b["coldiff"];});
// // 昇順になったANSI colorからなる配列の生成
// var colArr = [];
// for(var index in cie){
//     colArr.push(cie[index]["color"]);
// }
// JSON.stringify(colArr);


// ----- 昇順になったANSI color -----
$colArr = json_decode('["16","52","17","59","53","18","23","24","88","54","89","19","60","22","90","58","55","95","25","20","125","124","91","96","56","61","94","126","21","92","26","127","57","97","66","102","131","62","30","161","29","31","65","160","93","130","132","128","67","162","101","27","28","98","133","163","64","103","63","32","129","100","68","164","167","138","99","134","137","168","166","197","196","33","198","104","169","165","139","136","199","135","69","170","200","140","105","173","203","174","204","35","36","202","37","171","201","172","73","34","72","205","71","175","38","109","141","108","74","70","107","145","206","110","176","39","144","106","143","75","207","209","177","210","146","208","142","211","111","212","180","181","179","147","178","213","182","41","42","183","43","40","215","216","78","44","77","79","217","76","214","80","45","113","114","115","218","112","81","116","150","151","117","152","219","149","148","153","188","187","186","185","184","189","223","222","221","220","224","46","225","48","47","49","82","84","50","83","85","51","120","86","119","118","121","87","122","154","156","123","155","157","158","159","191","193","192","190","194","195","231","230","229","228","227","226"]');
// こちらはwhiteとの色差
$colArr = json_decode('["231","188","195","230","224","189","152","187","223","153","145","194","225","159","229","181","151","117","158","193","116","123","222","146","186","180","144","182","87","122","157","81","109","228","217","110","51","86","150","192","115","218","121","80","216","50","45","221","156","219","85","183","185","79","114","147","227","44","120","191","49","179","149","74","215","111","108","155","84","43","78","143","73","119","113","48","226","220","75","190","83","184","102","42","154","77","211","47","138","212","38","148","210","118","107","39","214","82","213","72","174","175","209","41","112","178","176","46","139","37","173","137","103","76","177","142","71","140","40","36","101","208","106","141","67","66","104","205","35","206","204","207","172","70","105","203","68","136","69","34","169","170","168","65","171","31","202","32","167","33","100","201","30","200","133","134","135","199","166","132","198","131","64","197","29","95","99","96","97","196","98","130","59","165","164","28","60","63","163","162","62","61","161","94","27","129","160","26","25","128","24","58","127","23","126","93","125","124","92","22","57","91","90","56","89","21","88","55","20","54","53","19","52","18","17","16"]');

// 色を見てみる
foreach($colArr as $col){
        print "\x1b[38;5;${col}m$col\x1b[0m ";
}
?>
